Tekla Open API Reference for Tekla Structures 2025
RebarSpacing.Offset.Type Field
 Defines whether the distance is intended as a fixed or a minimum distance.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarSpacing.OffsetEnum Type
Public Type As RebarSpacing.OffsetEnum
Field Value
Type: RebarSpacing.OffsetEnum
See Also
Reference
RebarSpacing.Offset Structure
Tekla.Structures.Model Namespace